package com.shivajayanti.abhishek.shivajayanti_dbatu_2k18;

import android.content.DialogInterface;
import android.content.Intent;
import android.support.v7.app.AlertDialog;
import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.view.MenuItem;
import android.view.View;
import android.widget.Button;
import android.widget.TextView;

import java.util.ArrayList;
import java.util.Collections;
import java.util.Random;

public class question extends AppCompatActivity {

    private TextView countlabel;
    private TextView questionlabel;
    private Button answerbtn1;
    private Button answerbtn2;
    private Button answerbtn3;
    private Button answerbtn4;

    private String rightanswer;
    private String post;
    private int rightanswercount=0;
    private int quizcount=1;
    static final private int QUIZ_COUNT=14;


    ArrayList<ArrayList<String>> quizarray= new ArrayList<>();
    String quizdata[][]= {
            {"शिवरायांचा जन्म किती साली झाला ?","१६२७" , "१६३२ ", "१६२८","१६३४"},
            {"शिवरायांचा जन्म कोणत्या किल्ल्या वर झाला?", "शिवनेरी ","राजगड ", "पुरंदर ", "रायगड"},
            {"शिवराय युद्धाकौशल्य कोणाकडून शिकले ?", "दादोजी कोंडदेव ","एकनाथ ","रघुनाथराव ", "बालाजीराव "},
            {"शिवरायांनी कोणत्या स्थानिक लोकांचा बंदोबस्त करायला लागला ?","पुंड पालेघर ","देशमुख ", "रांझेचे पाटील ","कोणतेही नाही "},
            {"पुंड पालेघाराचा स्वराज्यात सामील झालेल्या सरदाराचे नाव काय ?","भिमाजी वाघ ","नूरखान बेग ","बाजीप्रभू देशपांडे","मोरारबाजी देशपांडे"},
            {"एका स्त्रीवर बलात्कार केला म्हणून शिवरायांनी कोणाला शिक्षा केलीं?","रांझेचा पाटील ", "मिया रहिम ","फतेह खान ","इनायत खान "},
            {"शिवारायांनी रांझेच्या पाटलाला काय शिक्षा दिली ?","चौरंगा","तोफेच्या तोंडी ","हत्तीच्या पायी ","कडेलोट "},
            {"तोरणा किल्ल्याच्या किल्लेदाराने कोणाला शिवरायांवर प्राणघातक हल्ला करण्यासाठी पाठवले होते ?","नूरखान बेग","इनायत खान ","फातेह खान ","खावास खान"},
            {"शिवरायांनी तोरणा वयाच्या कितव्या वर्षी जिंकला ?","१६","१४","१८","२०"},
            {"शिवरायांनी तोरणा जिंकल्या वर कोणाला तोफेच्या तोंडी दिले ?","इनायत खान","नूर खान बेग ","खवाय खान ","जाफर खान "},
            {"शिवरायांनी तोरण्याचे नाव बदलून काय ठेवले ?","प्रंचंड गड ","लोहगड","विशालगड ", "राजगड "},
        {   "स्वराज्याच्या पायादलाचे पहिले सरनोबत कोण?" ,"नूरखान बेग","बाजी पासलकर","नेताजी पालकर","प्रतापराव गुजर"},
        {   "शिवरायांकडून पुरंदर परत मिळवण्यासाठी आदिलशाहने कोणत्या सरदारास पाठवले ?" ,"१.फतेह खान ","२.रंदुल्ला खान ","३.फझल खान ","४.खवय खान "},
        {   "पुरंदरच्या लढाईत कोणते मराठा सरदार शहीद झाले ?","बाजी पासलकर","बाजीप्रभू देशपांडे ","रामजी पांगेरा ","कोंडाजी फरजत "},
        {   "शहाजीराजांनी कैदेतून सुटका करण्या साठी शिवरायांनी कोणाला पत्र पाठवले ?","मुघल ","कुतुबशाह ","इंग्रज ","पोर्तुगीज"},
        {   "शहाजी राजांना  सोडल्यावर महाराजांनी कोणता किल्ला आदिलशहाला परत केला ?","कोंढाणा ","तोरणा ","पुरंदर ","लोहगड"},
        {   "शिवरायांनी रायरीचा किल्ला कोणाकडून जिंकला ?","चंद्रराव मोरे ","यशवंतराव मोरे ","प्रतापराव मोरे ","कोणतेही नाही "},
        {   "शिवरायांनी रायरीच्या किल्ल्याचे नाव बदलून काय ठेवले ?","रायगड ","राजगड ","प्रतापगड ","प्रचंडगड "},
        {"जावळीच्या विजयात शिवरायांनी कोणत्या माणसांना स्वराज्यात सामील करून घेतले ?","सर्व","बाजीप्रभू देशपांडे ","मोरारबाजी देशपांडे ","नाही "},
        {"शिवरायांनी पहिली राजधानी कोठे स्थापित केली ?","राजगड ","प्रचंडगड","रायगड ","जिंजी "},
        {"शिवरायांनी स्वराज्याची शपथ कोठे घेतली ?","रायरेश्वर  ","प्रतापगड ","लाल महाल ","राजगड "},
            {"बडी बेगमने स्वराज्यावर चालून जाण्यासाठी कोणाला पाठवले ?","अफजल खान","सिद्दी जौहर","सिद्दी मसूद","सलाबत खान"},
            {"अफजल खानाला कोणते सरदार फितूर झाले ?","खंडोजी खोपडे","गणोजी शिर्के","सुर्वे","मंबाजी भोसले"},
            {"अफजलखानाचे वाई कडील सैन्य रोखण्याची जबाबदारी महाराजांनी कोणावर सोपवली होती ?","नेताजी पालकर","मोरोपंत पिंगळे","नीळकंठपंत अमात्य","निराजी रावजी "},

                    {"खंडोजी खोपडे यांना छत्रपती शिवरायांनी कोणती शिक्षा दिली ?","उजवा हात आणि डावा पाय तोडला ","चौरंगा","तोफेच्या तोंडी दिले ","कडेलोट "},
                    {"शिवरायांनी अफझल खान कडे आपला कोणता वकील पाठवला ?", "गोपीनाथ बोकील ","सोनोपंत ","काझी हैदर ","निराजी पंत"},

                    {"अफझलखानाच्या वकिलाचे नाव काय ?","कृष्णाजी भास्कर ","सय्यद बंडा ","फझल खान ","रुस्तामे जमाल ",},
                            {"शिवरायांनी भोर्प्या डोंगरावर कोणता किल्ला बांधला ?","प्रतापगड ","राजगड","रायगड ","प्रचंडगड ",},
                                    {"अफझलखानाचा प्रमुख अंगरक्षक कोण?","सय्यद बंडा ","रुस्तामे जमल ","कृष्णाजी भास्कर कुलकर्णी ","फझल खान "},
                                            {"शिवरायांनी अफझलखानाला भेटीसाठी कोठे बोलवले ?","प्रतापगड च्या पायथ्याशी ","पारगाव खंडाळा ","वाई", "महाबालेश्वर "},
                                            {"अफझल खानच्या भेटीच्या वेळी किती अंगरक्षक घ्याचे ठरले ?","१०","५","१५","२०"},
    {"शिवरायांनी अंगरक्षक म्हणून कोणाला घेतले ?","वरील सर्व ","जीवा महाले","संभाजी कावजी कोंढाळकर ","कृष्णाजी कंक"},
    {"अफजल खानाला मारण्यासाठी शिवरायांनी कोणते शस्त्र वापरले ?","वाघनख","बिचवा","तलवार ","विटा "},
    {"सय्यद बंडाला कोणी मारले ?","जीवा महाले","येसाजी कंक ","संभाजी कोंढाळकर ","कृष्णाजी गायकवाड "},
    {"अफजलखानाच्या भोयांचे पाय कोणी तोडले ?","संभाजी कोंढाळकर ","जीवा  महाले ","कृष्णाजी कंक","कृष्णाजी गायकवाड "},
    {"अफजलखानाचा शिरछेद कोणी केला ?","संभाजी कोंढाळकर","जीव महाले ","कृष्णाजी कंक ","कृष्णाजी गायकवाड "},
    {"महाराजांनी अफजल  खानची समाधी कोठे बांधली ?","प्रतापगड ","राजगड ","लोहगड ","वासोटा "},
    {"अफजल खानानंतर बडी बेगमने कोणाला स्वराज्यावर चालून पाठवले ?","सिद्दी जोहर ","सिद्दी मलिक ","सिद्दी अंबर ","सिद्दी मसूद "},
    {"सिद्दी जोहरने कोणत्या किल्ल्यास वेढा दिला ?","पन्हाळा ","प्रताप[गड ","खेळना ","राजगड "},
    {"सिद्दी जोहरला तोफांची मदत कोणी केली ?","इंग्रज ","पोर्तुगीज ","फ्रेंच ","डच "},
    {"सिद्दी जोहरच्या गोटात महाराजांनी तोतया म्हणून कोणाला पाठवले ?","शिवा काशीद ","तानाजी मालुसरे ","येसाजी कंक ","हिरोजी फर्जद "},
    {"जोहरच्या वेढ्यातून निसटताना महाराजांसोबत किती मावळे होते ?","६०० ","१००० ","३०० ","८०० "},
    {"गजापुरची खिंड लढवायची जबाबदारी महाराजांनी कोणाला दिली ?","बाजीप्रभू देशपांडे ","शिवा काशीद ","येसाजी कंक ","प्रतापराव गुजर "},
    {"महाराजांनी बाजी प्रभूसोबत किती मावळे ठेवले ?","३००","८००","९००","६००"},
        {"महाराज जोहरच्या वेढ्यातून निसटून कोणत्या किल्ल्यावर गेले ?","खेळणा ","प्रतापगड ","वासोटा ","राजगड "},
        {"शिवरायांनी खेळण्याचे नाव बदलून काय ठेवले ?","विशालगड ","प्रचंडगड ","प्रतापगड ","सिंहगड "},
        {"शिवरायांनी गजापुरच्या खिंडीस काय नाव दिले ?","पावनखिंड ","उंबरखिंड ","कोकणखिंड ","विंचूकाटा "},
        {"विशालगडाच्या खाली महाराजांना कोणाच्या प्रतिकार करावा लागला ?","अ व ब ","अ .सुर्वे ","ब.दळवी ","मोरे "},
            {"शिवरायांनी विशालगडावर पोहचल्यावर कोणता इशारा केला ?","तोफेचा इशारा ","काळा धूर ","लाल धूर ","पांढरा "},
            {"आदिलशहाशी केलेल्या तहात शिवरायांनी कोणता किल्ला परत केला ?","पन्हाळा ","प्रतापगड ","प्रचंडगड ","पदमदुर्ग "},
                {"औरंगजेबाने स्वराज्यावर कोणाला चालून पाठवले ?","शहिस्तेखान ","कारतलबखान ","दिलेरखान ","रायबेगन "},
                {"शाहिस्तेखान याने पुण्यात कोठे तळ ठोकला?","लाल महाल ","शिवापूर","राजगड","सिंहगड"},
                {"चाकण चे किल्लेदार कोण होते ?","फिरंगोजी नरसाळे ","नेताजी पालकर","सूर्याजी काटे","मोरारजी देशपांडे"},
                {"उंबरखिंडीत शिवरायांनी कोणावर हल्ला केला ?","कर्तलाब खान ","शाहिस्तेखान","रायबेगम ","दिलेरखान"},
                {"शाहिस्तेखान याने पुण्यात किती दिवस मुक्काम ठोकला ","३ वर्ष ","१ वर्ष ","२वर्ष ","४ वर्ष "},
                    {"शिवरायानी शाहिस्तेखानवर कोठे हल्ला केला ?","लाल महाल ","वासोटा ","उंबरखिंड","कात्रज घाट"},
                    {"शिवरायांनी शाहिस्तेखानाचे काय तोडले ?","बोटे ","हात ","पाय ","शीर"},
                    {"शिवरायांनी खानाच्या सैन्यास कोठे भरकटवले ?","कात्रज घाट ","आंबा घाट ","फोंडा घाट ","आंबोली घाट "},
                    {"महाराष्ट्र मधील अपयशामुळे औरंगझेबाने शाहिस्तेखानाची बदली कोठे केली","काबुल ","पंजाब ","आसाम ","तंजावर "},
                        {"एका स्त्रीशी बदअंमल केला म्हणून शिवरायांनी कोणाचे डोळे काढले ?","आबाजी सोनदेव ","रंझाचे पाटील ","खंडोजी खोपडे ","रंगोजी वाकडा "},
                        {"शहाजी राजांच्या मृत्यू नंतर महाराजानि कोनाला ठार मारले ?","बाजी घोरपडे ","बजाजी निबाळकर","रुस्तमे जमाल ","मुस्तफा खान "},
                        {"शिवरायांनी शाहिस्तेखानाने केलेले नुकसान भरून काढण्यासाठी कोठे स्वारी केली ?","सुरत ","दिल्ली ","कारंजे ","बुऱ्हानपूर",},
                        {"सुरत ची माहिती काढण्याचे  काम महराजांनी कोणाला सोपवले ?","बहिर्जी नाईक ", "विश्वासराव ", "रामजी पांगेरा ","भिमाजी वाघ "},
                        {"शिवरायांनी सुरतवर किती साली स्वारी केली ?","१६६४","१६६३","१६६६","१६६५"},
                        {"सुरत लुटल्यावर औरंगझेबाने स्वराज नष्ट करण्यासाठी कोनाला पाठवले ?","२ व ३","मुस्तफा खान ","2.मिर्झा राजे जयसिंग ","3.दिलेरखान "},
                        {"दिलेरखानाने कोणत्या किल्ल्यास वेढा दिला ?","पुरंदर ","राजगड","पन्हाळा "," प्रतापगड"},
                        {"पुरंदरचे किल्लेदार कोण होते ?","मोरारबाजी","फिरंगोजी नरसाळा","नेताजी पालकर ","रामजी पांगेरा "},
                        {"पुरंदरावरील दारू गोळ्याच्या कोठारला आग लागल्याने किती मावळे धारातीर्थी पडले ?","८०","९०","१००","२००"},
                            {"पुरंदर जिंकण्या साठी दिलेर खानाने आधी कोणता किल्ला जिंकला?","वज्रगड ","लिंगाणा","लोहगड","चाकण"},
                            {"मुघलांना लांब पल्ल्या च्या तोफांची मदत कोणी केली ?","इंग्रज","पोर्तुगीझ ","डच","फ्रेंच "},
                                {"पुरंदर च्या तहात शिवरायांनी मुघलांना किती किल्ले दिले ?","२३","२२","२४","२५"},
                                {"पुरंदरच्या तहात शिवरायांनी मुघलांना किती होनांचा प्रदेश दिला ?","५","१०","१५","२०"},
                                    {"शिवरायांचा पराभव करण्यासाठी मिर्झाराजे जयसिंग यांनी कोणता यज्ञ केला ?","कोतीचडी","अश्वनेध ","राजसूय ","१ व २ "},
                                    {"शिवराय पुरंदर  तहानुसार किल्ले देई पर्यंत मुघलांच्या गोटात कोण ओलीस राहिले ?","युवराज संभाजी महाराज ","नेताजी पालकर ","निराजी पंत ","मोरो पंत "},
                                        {"पुरंदरच्या तहानंतर मिर्झाराजे जयसिंग याने आपला रुख कोठे वळवला?","आदिलशाह ","जंजिरा चा सिद्दी ","कुतुबशाह ","इंग्रज"},
                                        {"पन्हाळा मोहिमेत उशिरा पोचल्याने शिवरायांनी कोणाला बडतर्फ केले ?","नेताजी पालकर ","येसाजी कंक ","प्रताप गुजर ","हंभीरराव मोहिते "},
                                        {"सरनोबत नेताजी पालकर कोणत्या शत्रू पक्षात जाऊन मिळाले ?","मुघल","इंग्रज","कुतुबशहा ","सिद्दी "},
                                        {"नेताजी पालकर यांना लोक कोणत्या नावाने ओळखत ?","प्रतिशिवाजी ","प्रतापराव ","हंबीरराव ","फरजत "},
                                        {"नेताजी पालकरांचे औरंगझेबाने धर्मांतर करून नाव काय ठेवले ?","मोहमद कुली खान ","वसीम खान ","खावास खान ","बहलोल खान "},

            {"औरंगजेबाची भेट घेण्याचा आग्रह शिवरायांना कोणी केला ?","मिर्झाराजे  ","खवास खान ","दिलेरखान ","ज़ुल्फ़िक़र खान "},
            {"शिवराय औरंगजेबाची भेट घेण्यास कोठे गेले?","आग्रा ","दिल्ली","मथुरा","बुऱ्हानपूर"},
            {"शिवरायांनी औरंगजेबाच्या भेटीस जाताना कोणाला सोबत घेतले ","यापैकी सर्व ","हिरोजी फर्झंद","मदारी मेहतर","युवराज शंभूराजे "},
            {"शिवरायांची आणि औरंगजेबाची भेट कोठे झाली ?","दिवाण ए आम ","दिवान ए खास "," दिल्ली दरबार ","फतेहपुर सिक्री "},
            {"आग्रा मध्ये शिवरायांच्या स्वागतासाठी कोण आले?","रामसिंग चे मुन्शी ","रामसिंग ","मिर्झाराजे ","ज़ुल्फ़िक़र खान "},
            {"शिवरायांना औरंगजेबाच्या कैदेत किती दिवस राहावे लागले?","६ महिने ","८ महिने ","३ महिने ","२ महिने"},
            {"शिवरायांनी नजरकैदेत असताना कोणते नाटक केले?","आजारी पडल्याचे ","घाबरल्याचे ","शरण येण्याचे "," रागावल्याचे "},
            {"शिवरायांनी नजरकैदेत असताना कशाचे वाटप सुरु केले ?","मिठाईचे ","मोत्यांचे ","हिऱ्यांचे","मोहरांचे "},
            {"आग्र्यावरून शिवराय कसे पसार झाले ?","पेटाऱ्यातून ","घोड्यावरून","वेषांतर करून","बहुरूपी बनून"},
            {"शिवराय आग्र्याहून पळून गेल्यानंतर त्यांच्या जागी कोण झोपून राहिले ?","हिरोजी फर्झंद ","मदारी मेहतर ","निराजी राव ","रामसिंग "},
            {"शिवरायांनी आग्र्याहून परत येताना शंभूराजांना कोठे ठेवले ?","मथुरा ","आग्रा ","बनारस","सुरत"},
            {"शिवराय आग्र्याहून सही सलामत राजगडवर कोणत्या वेशात आले?","संन्याशी ","फकीर","सैनिक","पंडित"},
            {"शिवरायांनी स्वराज्याची दुसरी राजधानी कोठे स्थापित केली ?","रायगड ","राजगड","विशालगड", "प्रतापगड "},
            {"रायगडचे बांधकाम कोणी केले ?","हिरोजी इंदुलकर ","हिरोजी फर्झंद","कान्होजी आंग्रे ","मोरोपंत पिंगळे "},
            {"शिवरायानी कुडतोजी गुजर यांना कोणती पदवी दिली ?","प्रतापराव","हंबीरराव ","चंद्रराव ","यशवंतराव"},
            {"शहाजी राजांच्या छोट्या भावाचे नाव काय ?","शरीफजी ","तुकोजी ","मालोजी ","मंबाजी "},
            {"शहाजी महाराजांच्या च्या द्वितीय पत्नीचे नाव काय ?","तुकाऊ","जिजाऊ","राजाऊ","सख्वारबाई"},
            {"शहाजी राजाना आदिलशाह ने कोणती पदवी दिली?","सरलष्कर ","फर्जंद","सरनोबत ","प्रतापराव "},
            {"प्रतापराव गुजर आणि बहलोल खान यांच्यात अखेरचे युद्ध कोठे जाहले ?","नेसरी ","कोल्हापूर ","मिरज ","बेळगाव "},
            {"वेडात मराठी वीर दौडले ..........","सात ","आठ ","सहा ","पाच "},
            {"प्रतापराव गुजर यांची समाधी कोठे आहे ?","नेसरी ","कोल्हापूर ","मिरज ","सोलापूर "},
            {"शिवरायांनी कोंढाणा घेण्याची जबाबदारी कोणावर सोपवली ?","तानाजी मालुसरे ","रामजी पांगेरा ","प्रतापराव गुजर ","मोरोपंत पिंगळे "},
            {"तानाजी मालुसरे यांनी कोढाण्यामध्ये कोणत्या बाजुने प्रवेश केला ?","द्रोणागिरी कडा ","कल्याण दरवाजा ","कोकण दरवाजा ","तीन दरवाजा "},
            {"कोंढाणाचे किल्लेदार कोण होते ?","उदयभान राठोड ","जसवंत सिंग ","रामसिंग ","जयसिंग "},
            {"शिवरायानी कोंढाण्याचे नाव बदलून काय ठेवले ?","सिंहगड ","प्रतापगड ","विशालगड ","रायगड "},
            {"शिवरायांनी सुरतवर दुसऱ्या वेळी स्वारी किती साली केली ?","१६७० ","१६६९","१६७१","१६७२"},
            {"शिवरायांकडून प्रेरणा घेवून बुंदेलखंडात स्वतचे राज्य कोणी स्थापन केले ?","छत्रसाल","जयसिंग ","रामसिंग ","जसवंत सिंग "},
            {"शिवरायांच्या राज्याभिषेकाला काशीहून कोणत्या पंडिताला बोलावले होते ?","गागाभट्ट","केशव पंडित ","कल्याण स्वामी ","नारायण भट्ट"},
            {"शिवरायांचा राज्याभिषेक किती साली झाला ?","१६७४","१६७५","१६७३","१६७६"},
            {"शिवरायांचे सिंहासन किती मणाचे होते ?","३२","३४","३६","३८"},
            {"राज्याभिषेकसमयी शिवरायांच्या डोक्यावर छत्र धरण्याचा मान कोणाला मिळाला ?","अनाजी पंत ","मदारी मेहतर ","हिरोजी फर्जंद","हिरोजी इंदुलकर "},
            {"शिवरायांनी कुलमुख्त्यार पदाची शिक्के कट्यार कोणाला सोपवली ?","येसूबाई ","सोयराबाई","पुतळाबाई","शंभूराजे"},
            {"शिवराज्याभिषेकाला कोणता इंग्रज अधिकारी उपस्थित होता ?","मनुची ","नेल्सन ","मार्शल ","जोहान"},
            {"शिवरायांनी हंसाजी मोहिते यांना कोणती पदवी बहाल केली ? ","हंबीरराव ","प्रतापराव ","चंद्रराव ","आनंदराव "},
            {"प्रतापराव गुजर यांच्यानंतर महाराजानी कोणाला सरसेनापती केले ?","हंसाजी मोहिते","आनंदराव ","धनाजीराव ","संताजीराव "},
            {"स्वराज्यातील अष्टप्रधानमंडळात प्रधान कोण होते ?","मोरोपंत पिंगळे ","अण्णाजी दत्तो ","निराजी रावजी ","रघुनाथराव "},
            {"रामचंद्रपंत नीलकंठ हे अष्टप्रधानमंडळात कोणत्या पदावर कार्यरत होते ?","अमात्य ","सचिव ","वाकनीस","प्रधान "},
            {"अष्टप्रधानमंडळात सचिव या पदी शिवरायांनी कोणाची नेमणूक केली ?","अण्णाजी दत्तो ","दत्ताजी पंत ","रामचंद्र त्रिंबक","रघुनाथराव "},
            {"जमिनीची प्रतवारी लावण्याचे काम कोणी केले ?","अण्णाजी दत्तो ","मोरोपंत ","रामचंद्र पंत ","सोनोपंत "},
            {"वाकनीस म्हणून अष्टप्रधानमंडळात कोणाची नेमणूक झाली ?","दत्ताजी पंत ","अनाजी पंत ","रघुनाथराव ","सोनोपंत "},
            {"अष्टप्रधानमंडळात सरसेनापती कोण होते ?","हंबीरराव मोहिते ","नेताजी पालकर ","प्रतापराव गुजर ","तानाजी मालुसरे "},
            {"रामचंद्रपंत त्रिंबक अष्टप्रधानमंडळात कोणत्या पदावर कार्यरत होते ?","सुमंत ","वाकनीस ","न्यायाधीश","प्रधान"},
            {"अष्टप्रधानमंडळात सरन्यायाधीश कोण होते ?","निराजी रावजी ","रघुनाथराव ","अण्णाजी दत्तो ","मोरोपंत पिंगळे "},
            {"अष्टप्रधानमंडळात दानाध्यक्ष म्हणून शिवरायांनी कोणाची निवड केली ?","रघुनाथराव ","मोरोपंत ","अनाजी पंत ","रामचंद्र पंत "},
            {"अष्टप्रधानमंडळात प्रधान कोणते काम पाहत असे ?","राज्यकारभार ","महसूल ","हेर खाते ","पत्रव्यवहार"},
            {"जंजिरा जिंकण्यासाठी तटबंदी ला शिड्या लावण्याचे काम कोणी केले ?","लाया पाटील","रामजी पांगेरा ","दौलत खान ","कान्होजी आंग्रे "},
            {"सरसेनापतीना वार्षिक किती पगार मिळत असे ?","१० हजार होन ","१२ हजार होन","१३ हजार होन","१५ हजार होन"},
            {"डबीर रामचंद्रपंत यांची काय जबाबदारी होती ?","परराष्ट्र व्यवहार","न्यायदान ","दानधर्म","महसूल "},
            {"जंजिराला शह देण्यासाठी महाराजानी कोणता किल्ला बांधला ?","पद्मदुर्ग ","सिंधुदुर्ग ","विजयदुर्ग","कोलाबा "},
            {"महाराजानी आरमारचे प्रमुख म्हणून कोणास नेमले ?","कान्होजी आंग्रे ","कान्होजी जेधे ","मोरोपंत ","अनाजी पंत "},
            {"शिवरायांनी समुद्र मार्गे कोणत्या देशापर्यंत व्यापार सुरु केला ?","मस्कत","फ्रान्स ","इंग्लंड ","इराण "},
            {"शिवरायाच्या काळात कोणते चलन प्रचलित होते ?","होन ","येन ","रुपया ","मोहरा "},
            {"तांब्याच्या चलनास काय म्हणत असत ?","शिवराई","होन ","रुपया ", "डॉलर"},
            {"शिवाजी महाराजांनी एकूण किती किल्ले बांधले ?","१११","१०८","१०९","११०"},
            {"शिवरायांकडे एकूण किती किल्ले होते ?","३६०","३७०","३८०","३५०"},
            {"शिवरायांनी दक्षिण दिग्विजय मोहीम कधी सुरु केली ","१६७६ ","१६७७","१६७८","१६७५"},
            {"कुतुबशहाच्या मैदानात कोणत्या मराठा सरदाराने हत्तीशी झुंज दिली ?","येसाजी कंक ","कृष्णाजी कंक","रामजी पांगेरा ","संताजी घोरपडे "},
            {"जिंजी भागात शिवरायांनी कारभार करण्यासाठी कोणाची निवड केली ?","रघुनाथ पंत हणमंते ","व्यंकोजी राजे ","मोरोपंत ","येसाजी कंक "},
            {"शिवराय आणि शंभू राजे यांची शेवट ची भेट कोणत्या गडावर झाली ?","पन्हाळा ","रायगड ","विशालगड","प्रतापगड"},
            {"शिवरायांची समाधी कोणत्या किल्ल्यावर आहे ?","रायगड ","शिवनेरी ","प्रतापगड ","सिंहगड "},
            {"शिवरायांचा मृत्यू किती साली झाला ?","१६८०","१६८१","१६७७","१६८२"},
            {"शिवरायांचे नाव शिवाजी कोणत्या देवीच्या नावाने ठेवले होते?","शिवाई ","दुर्गा ","तुळजाभवानी","वैष्णोदेवी"},
            {"शंभू राजांचा जन्म कोणत्या किल्ल्यावर झाला ?","पुरंदर ","राजगड ","रायगड ","शिवनेरी "},
            {"शंभूराजांच्या आईचे नाव काय होते ?","सईबाई","उमाबाई","पार्वती","कावेरीबाई "},
            {"शंभूराजांच्या पत्नीचे नाव काय होते ?","येसूबाई","पुतळाबाई ","सोयराबाई ","सगुणाबाई "},
            {"शंभूराजांनी वयाच्या कितव्या वर्षी संस्कृत ग्रंथ लिहला ?","१४","११","१२","१३"},
    {"शंभूराजांनी संस्कृत मधून कोणते ग्रंथ लिहले ?","यापैकी सर्व ","बुधभूषण ","नखशिखांत","सातसतक"},
        {"शंभूराजांनी कोणता किल्ला ६ वर्ष झुंजवत ठेवला ?","रामशेज  ","साल्हेर ","मुल्हेर ","शिवनेरी "},
        {"शंभूराजांनी कोणत्या किल्लावर लाकडी तोफा तयार केल्या?","रामशेज ","साल्हेर ","मुल्हेर ","शिवनेरी "},
        {"शंभूराजांचा मृत्यू वयाच्या कितव्या वर्षी झाला ?","३२","३१ ","३३","३४"},
        {"शंभूराजांनी कोणता किल्ला जिंकण्यासाठी समुद्रावर पूल बांधायला घेतला?","जंजीरा ","उंदेरी ","विजयदुर्ग","सिंधुदुर्ग"},


    };


    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_question);


        getSupportActionBar().setDisplayShowHomeEnabled(true);
        getSupportActionBar().setDisplayHomeAsUpEnabled(true);

        countlabel=(TextView)findViewById(R.id.textquestionno);
        questionlabel=(TextView)findViewById(R.id.textquestion);
        answerbtn1=(Button)findViewById(R.id.button1);
        answerbtn2=(Button)findViewById(R.id.button2);
        answerbtn3=(Button)findViewById(R.id.button3);
        answerbtn4=(Button)findViewById(R.id.button4);

        for(int i=0; i< quizdata.length;i++)
        {
            ArrayList<String> tmparray= new ArrayList<>();
            tmparray.add(quizdata[i][0]);//country
            tmparray.add(quizdata[i][1]);//rightanser
            tmparray.add(quizdata[i][2]);//chooice1
            tmparray.add(quizdata[i][3]);//2
            tmparray.add(quizdata[i][4]);//3

            quizarray.add(tmparray);


        }
        shownextquiz();

    }

    public void shownextquiz(){
        countlabel.setText("प्र"+ quizcount);

        Random random = new Random();
        int randomnum= random.nextInt(quizarray.size());
        ArrayList<String>quiz = quizarray.get(randomnum);
        questionlabel.setText(quiz.get(0));
        rightanswer= quiz.get(1);

        quiz.remove(0);
        Collections.shuffle(quiz);

        answerbtn1.setText(quiz.get(0));
        answerbtn2.setText(quiz.get(1));
        answerbtn3.setText(quiz.get(2));
        answerbtn4.setText(quiz.get(3));


        quizarray.remove(randomnum);
    }

    public void checkanswer(View view ){
        Button answerbtn = (Button) findViewById(view.getId());
        String btntxt = answerbtn.getText().toString();

        String alerttitle;

        if(btntxt.equals(rightanswer)){
            alerttitle="CORRECT";
            rightanswercount++;
        }
        else
        {
            alerttitle="WRONG!";
            quizcount=14;
        }

        AlertDialog.Builder builder = new AlertDialog.Builder(this);
        builder.setTitle(alerttitle);
        builder.setMessage("Answer :" + rightanswer);
        builder.setPositiveButton("OK", new DialogInterface.OnClickListener() {
            @Override
            public void onClick(DialogInterface dialogInterface, int i) {


                if(quizcount==QUIZ_COUNT){

                    if(rightanswercount==1 || rightanswercount==0){


                    Intent intent = new Intent(getApplicationContext(),resultactivity.class);
                    intent.putExtra("post","शिपाई");

                    startActivity(intent);
                    }else if(rightanswercount==2)
                    {
                        Intent intent = new Intent(getApplicationContext(),resultactivity.class);
                        intent.putExtra("post"," नाईक");
                        startActivity(intent);
                    }else if(rightanswercount==3)
                    {
                        Intent intent = new Intent(getApplicationContext(),resultactivity.class);
                        intent.putExtra("post"," घोडेस्वार");
                        startActivity(intent);
                    }else if(rightanswercount==4)
                    {
                        Intent intent = new Intent(getApplicationContext(),resultactivity.class);
                        intent.putExtra("post","हवालदार");
                        startActivity(intent);
                    }else if(rightanswercount==5)
                    {
                        Intent intent = new Intent(getApplicationContext(),resultactivity.class);
                        intent.putExtra("post","जुमलेदार");
                        startActivity(intent);
                    }else if(rightanswercount==6)
                    {
                        Intent intent = new Intent(getApplicationContext(),resultactivity.class);
                        intent.putExtra("post","जमादार");
                        startActivity(intent);
                    }else if(rightanswercount==7)
                    {
                        Intent intent = new Intent(getApplicationContext(),resultactivity.class);
                        intent.putExtra("post","गुप्तहेर");
                        startActivity(intent);
                    }else if(rightanswercount==8)
                    {
                        Intent intent = new Intent(getApplicationContext(),resultactivity.class);
                        intent.putExtra("post","एक हजारी मनसबदार ( पायदळ )");
                        startActivity(intent);
                    }else if(rightanswercount==9)
                    {
                        Intent intent = new Intent(getApplicationContext(),resultactivity.class);
                        intent.putExtra("post","एक हजारी मनसबदार ( घोडदळ )");
                        startActivity(intent);
                    }else if(rightanswercount==10)
                    {
                        Intent intent = new Intent(getApplicationContext(),resultactivity.class);
                        intent.putExtra("post"," सप्त हजारी मनसबदार ( पायदळ )");
                        startActivity(intent);
                    }else if(rightanswercount==11)
                    {
                        Intent intent = new Intent(getApplicationContext(),resultactivity.class);
                        intent.putExtra("post","पंच हजारी मनसबदार ( घोडदळ )");
                        startActivity(intent);
                    }else if(rightanswercount==12)
                    {
                        Intent intent = new Intent(getApplicationContext(),resultactivity.class);
                        intent.putExtra("post","सरनोबत ( पायदळ )");
                        startActivity(intent);
                    }else if(rightanswercount==13)
                    {
                        Intent intent = new Intent(getApplicationContext(),resultactivity.class);
                        intent.putExtra("post","सरनोबत ( घोडदळ )");
                        startActivity(intent);
                    }else if(rightanswercount==14)
                    {
                        Intent intent = new Intent(getApplicationContext(),resultactivity.class);
                        intent.putExtra("post","सरसेनापती");
                        startActivity(intent);
                    }


                }
                else
                {
                    quizcount++;
                    shownextquiz();
                }
            }
        });

        builder.setCancelable(false);
        builder.show();

    }

    @Override
    public boolean onOptionsItemSelected(MenuItem item){

        int id= item.getItemId();
        if(id== android.R.id.home){
            this.finish();
        }
        return super.onOptionsItemSelected(item);
    }
}
